# PhyMaterialParamMinimumYieldStress Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialParamMinimumYieldStress Property
ParameterTypeId Class See Also
---
"Minimum yield stress"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialParamMinimumYieldStress { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialParamMinimumYieldStress As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialParamMinimumYieldStress {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace